MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFK124/mcu.h
#define _USBEOFRST_HSEOF_POSITION                0x00000000
#define _USBEOFRST_HSEOF_MASK                    0x000000FF
#define _USBEOFRST_HSEOF_LENGTH                  0x00000008

#define _USBEOFRST_FSEOF_POSITION                0x00000008
#define _USBEOFRST_FSEOF_MASK                    0x0000FF00
#define _USBEOFRST_FSEOF_LENGTH                  0x00000008

#define _USBEOFRST_LSEOF_POSITION                0x00000010
#define _USBEOFRST_LSEOF_MASK                    0x00FF0000
#define _USBEOFRST_LSEOF_LENGTH                  0x00000008

#define _USBEOFRST_NRST_POSITION                 0x00000018
#define _USBEOFRST_NRST_MASK                     0x01000000
#define _USBEOFRST_NRST_LENGTH                   0x00000001

#define _USBEOFRST_NRSTX_POSITION                0x00000019
#define _USBEOFRST_NRSTX_MASK                    0x02000000
#define _USBEOFRST_NRSTX_LENGTH                  0x00000001

#define _USBEOFRST_SOFRST_POSITION               0x00000018
#define _USBEOFRST_SOFRST_MASK                   0xFF000000
#define _USBEOFRST_SOFRST_LENGTH                 0x00000008

#define _USBE0TXA_TXFADDR_POSITION               0x00000000
#define _USBE0TXA_TXFADDR_MASK                   0x0000007F
#define _USBE0TXA_TXFADDR_LENGTH                 0x00000007

#define _USBE0TXA_TXHUBADD_POSITION              0x00000010
#define _USBE0TXA_TXHUBADD_MASK                  0x007F0000
#define _USBE0TXA_TXHUBADD_LENGTH                0x00000007

#define _USBE0TXA_MULTTRAN_POSITION              0x00000017
#define _USBE0TXA_MULTTRAN_MASK                  0x00800000
#define _USBE0TXA_MULTTRAN_LENGTH                0x00000001

#define _USBE0TXA_TXHUBPRT_POSITION              0x00000018
#define _USBE0TXA_TXHUBPRT_MASK                  0x7F000000
#define _USBE0TXA_TXHUBPRT_LENGTH                0x00000007

#define _USBE0RXA_RXHUBADD_POSITION              0x00000010
#define _USBE0RXA_RXHUBADD_MASK                  0x007F0000
#define _USBE0RXA_RXHUBADD_LENGTH                0x00000007

#define _USBE0RXA_MULTTRAN_POSITION              0x00000017
#define _USBE0RXA_MULTTRAN_MASK                  0x00800000
#define _USBE0RXA_MULTTRAN_LENGTH                0x00000001

#define _USBE0RXA_RXHUBPRT_POSITION              0x00000018
#define _USBE0RXA_RXHUBPRT_MASK                  0x7F000000
#define _USBE0RXA_RXHUBPRT_LENGTH                0x00000007

#define _USBE1TXA_TXFADDR_POSITION               0x00000000
#define _USBE1TXA_TXFADDR_MASK                   0x0000007F
#define _USBE1TXA_TXFADDR_LENGTH                 0x00000007

#define _USBE1TXA_TXHUBADD_POSITION              0x00000010
#define _USBE1TXA_TXHUBADD_MASK                  0x007F0000
#define _USBE1TXA_TXHUBADD_LENGTH                0x00000007

#define _USBE1TXA_MULTTRAN_POSITION              0x00000017
#define _USBE1TXA_MULTTRAN_MASK                  0x00800000
#define _USBE1TXA_MULTTRAN_LENGTH                0x00000001

#define _USBE1TXA_TXHUBPRT_POSITION              0x00000018
#define _USBE1TXA_TXHUBPRT_MASK                  0x7F000000
#define _USBE1TXA_TXHUBPRT_LENGTH                0x00000007

#define _USBE1RXA_RXFADDR_POSITION               0x00000000
#define _USBE1RXA_RXFADDR_MASK                   0x0000007F
#define _USBE1RXA_RXFADDR_LENGTH                 0x00000007

#define _USBE1RXA_RXHUBADD_POSITION              0x00000010
#define _USBE1RXA_RXHUBADD_MASK                  0x007F0000
#define _USBE1RXA_RXHUBADD_LENGTH                0x00000007

#define _USBE1RXA_MULTTRAN_POSITION              0x00000017
#define _USBE1RXA_MULTTRAN_MASK                  0x00800000
#define _USBE1RXA_MULTTRAN_LENGTH                0x00000001

#define _USBE1RXA_RXHUBPRT_POSITION              0x00000018
#define _USBE1RXA_RXHUBPRT_MASK                  0x7F000000
#define _USBE1RXA_RXHUBPRT_LENGTH                0x00000007

#define _USBE2TXA_TXFADDR_POSITION               0x00000000
#define _USBE2TXA_TXFADDR_MASK                   0x0000007F
#define _USBE2TXA_TXFADDR_LENGTH                 0x00000007

#define _USBE2TXA_TXHUBADD_POSITION              0x00000010
#define _USBE2TXA_TXHUBADD_MASK                  0x007F0000
#define _USBE2TXA_TXHUBADD_LENGTH                0x00000007

#define _USBE2TXA_MULTTRAN_POSITION              0x00000017
#define _USBE2TXA_MULTTRAN_MASK                  0x00800000
#define _USBE2TXA_MULTTRAN_LENGTH                0x00000001

#define _USBE2TXA_TXHUBPRT_POSITION              0x00000018
#define _USBE2TXA_TXHUBPRT_MASK                  0x7F000000
#define _USBE2TXA_TXHUBPRT_LENGTH                0x00000007

#define _USBE2RXA_RXFADDR_POSITION               0x00000000
#define _USBE2RXA_RXFADDR_MASK                   0x0000007F
#define _USBE2RXA_RXFADDR_LENGTH                 0x00000007

#define _USBE2RXA_RXHUBADD_POSITION              0x00000010
#define _USBE2RXA_RXHUBADD_MASK                  0x007F0000
#define _USBE2RXA_RXHUBADD_LENGTH                0x00000007

#define _USBE2RXA_MULTTRAN_POSITION              0x00000017
#define _USBE2RXA_MULTTRAN_MASK                  0x00800000
#define _USBE2RXA_MULTTRAN_LENGTH                0x00000001

#define _USBE2RXA_RXHUBPRT_POSITION              0x00000018
#define _USBE2RXA_RXHUBPRT_MASK                  0x7F000000
#define _USBE2RXA_RXHUBPRT_LENGTH                0x00000007

#define _USBE3TXA_TXFADDR_POSITION               0x00000000
#define _USBE3TXA_TXFADDR_MASK                   0x0000007F
#define _USBE3TXA_TXFADDR_LENGTH                 0x00000007

#define _USBE3TXA_TXHUBADD_POSITION              0x00000010
#define _USBE3TXA_TXHUBADD_MASK                  0x007F0000
#define _USBE3TXA_TXHUBADD_LENGTH                0x00000007

#define _USBE3TXA_MULTTRAN_POSITION              0x00000017
#define _USBE3TXA_MULTTRAN_MASK                  0x00800000
#define _USBE3TXA_MULTTRAN_LENGTH                0x00000001

#define _USBE3TXA_TXHUBPRT_POSITION              0x00000018
#define _USBE3TXA_TXHUBPRT_MASK                  0x7F000000
#define _USBE3TXA_TXHUBPRT_LENGTH                0x00000007

#define _USBE3RXA_RXFADDR_POSITION               0x00000000
#define _USBE3RXA_RXFADDR_MASK                   0x0000007F
#define _USBE3RXA_RXFADDR_LENGTH                 0x00000007

#define _USBE3RXA_RXHUBADD_POSITION              0x00000010
#define _USBE3RXA_RXHUBADD_MASK                  0x007F0000
#define _USBE3RXA_RXHUBADD_LENGTH                0x00000007

